design_model/src/main/resources/生产型模式/抽象工厂模式/抽象工厂方法.md
```mermaid
classDiagram
    class Factory {
        +AbstractProductA createProductA()
        +AbstractProductB createProductB()
    }
    class AbstractProductA {
    }
    class AbstractProductB {
    }
    class ConcreteProductA1 {
    }
    class ConcreteProductA2 {
    }
    class ConcreteProductB1 {
    }
    class ConcreteProductB2 {
    }
    class ConcreteFactory1 {
        +AbstractProductA createProductA()
        +AbstractProductB createProductB()
    }
    class ConcreteFactory2 {
        +AbstractProductA createProductA()
        +AbstractProductB createProductB()
    }
    ConcreteProductA1 --|> AbstractProductA
    ConcreteProductA2 --|> AbstractProductA
    ConcreteProductB1 --|> AbstractProductB
    ConcreteProductB2 --|> AbstractProductB
    ConcreteFactory1 --|> Factory
    ConcreteFactory2 --|> Factory
    ConcreteFactory1 ..> ConcreteProductA1 : create
    ConcreteFactory1 ..> ConcreteProductB1 : create
    ConcreteFactory2 ..> ConcreteProductA2 : create
    ConcreteFactory2 ..> ConcreteProductB2 : create
    Client ..> Factory
    Client ..> AbstractProductA
    Client ..> AbstractProductB
```
